app/Controllers/Artikel.php

    public function view($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where([
            'slug' => $slug,
        ])->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'artikel-pertama'
 LIMIT 1